AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/ucs.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2012, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//******************************************************************************
//
//ucs.c - Driver for the UCS Module.
//
//******************************************************************************

#include "inc/hw_regaccess.h"
#include "inc/hw_memmap.h"
#include "ucs.h"
#ifdef  __IAR_SYSTEMS_ICC__
#include "deprecated/IAR/msp430xgeneric.h"
#else
#include "deprecated/CCS/msp430xgeneric.h"
#endif
#include "assert.h"

static uint32_t
privateUCSSourceClockFromDCO ( uint32_t baseAddress,
    uint16_t FLLRefCLKSource
    );
	
static uint32_t
privateUCSComputeCLKFrequency ( uint32_t baseAddress,
    uint16_t CLKSource,
    uint16_t CLKSourceDivider
    );
	
//******************************************************************************
//
//The XT1 crystal frequency. Should be set with UCS_externalClockSourceInit
//if XT1 is used and user intends to invoke UCS_getSMCLK, UCS_getMCLK or
//UCS_getACLK
//
//******************************************************************************
uint32_t UCS_XT1ClockFrequency = 0;

//******************************************************************************
//
//The XT2 crystal frequency. Should be set with UCS_externalClockSourceInit
//if XT1 is used and user intends to invoke UCS_getSMCLK, UCS_getMCLK or
//UCS_getACLK
//
//******************************************************************************
uint32_t UCS_XT2ClockFrequency = 0;

//******************************************************************************
//
//! This function sets the external clock sources XT1 and XT2 crystal
//! oscillator frequency values. This function must be called if an external
//! crystal XT1 or XT2 is used and the user intends to call UCS_getMCLK,
//! UCS_getSMCLK or UCS_getACLK APIs. If not, it is not necessary to invoke this
//! API.
//!
//! \param baseAddress is the base address of the UCS module.
//! \param XT1CLK_frequency is the XT1 crystal frequencies in Hz
//! \param XT2CLK_frequency is the XT2 crystal frequencies in Hz
//!
//! \return None
//
//******************************************************************************
void
UCS_setExternalClockSource (uint32_t baseAddress,
    uint32_t XT1CLK_frequency,
    uint32_t XT2CLK_frequency
    )
{
    UCS_XT1ClockFrequency = XT1CLK_frequency;
    UCS_XT2ClockFrequency = XT2CLK_frequency;
}

//******************************************************************************
//
//! This function initializes each of the clock signals. The user must ensure
//! that this function is called for each clock signal. If not, the default
//! state is assumed for the particular clock signal. Refer MSP430ware
//! documentation for UCS module or Device Family User's Guide for details of
//! default clock signal states
//!
//! \param baseAddress is the base address of the UCS module.
//! \param selectedClockSignal - Valid values are
//!           \b UCS_ACLK,
//!           \b UCS_MCLK,
//!           \b UCS_SMCLK,
//!           \b UCS_FLLREF
//! \param clockSource is Clock source for the selectedClock Signal
//!            Valid values are
//!            \b UCS_XT1CLK_SELECT,
//!            \b UCS_VLOCLK_SELECT,
//!            \b UCS_REFOCLK_SELECT,
//!            \b UCS_DCOCLK_SELECT,
//!            \b UCS_DCOCLKDIV_SELECT
//!            \b UCS_XT2CLK_SELECT
//! \param clockSourceDivider - selected the clock divider to calculate
//!         clocksignal from clock source. Valid values are
//!           \b UCS_CLOCK_DIVIDER_1 [Default Value],
//!           \b UCS_CLOCK_DIVIDER_2,
//!           \b UCS_CLOCK_DIVIDER_4,
//!           \b UCS_CLOCK_DIVIDER_8,
//!           \b UCS_CLOCK_DIVIDER_12, [Valid ONLY for \b UCS_FLLREF]
//!           \b UCS_CLOCK_DIVIDER_16,
//!           \b UCS_CLOCK_DIVIDER_32 [Not valid for \b UCS_FLLREF]
//!
//! Modified registers are \b UCSCTL4, \b UCSCTL5, \b UCSCTL3
//! Note that the dividers for \b UCS_FLLREF are different from the available
//! clock dividers.
//!
//! \return None
//
//******************************************************************************
void
UCS_clockSignalInit ( uint32_t baseAddress,
    uint8_t selectedClockSignal,
    uint16_t clockSource,
    uint16_t clockSourceDivider
    )
{
    assert(
        (UCS_XT1CLK_SELECT == clockSource) ||
        (UCS_VLOCLK_SELECT == clockSource) ||
        (UCS_REFOCLK_SELECT == clockSource) ||
        (UCS_DCOCLK_SELECT == clockSource) ||
        (UCS_DCOCLKDIV_SELECT == clockSource) ||
        (UCS_XT2CLK_SELECT == clockSource)
        );

