AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/ucs.c
    assert(
        (UCS_CLOCK_DIVIDER_1 == clockSourceDivider) ||
        (UCS_CLOCK_DIVIDER_2 == clockSourceDivider) ||
        (UCS_CLOCK_DIVIDER_4 == clockSourceDivider) ||
        (UCS_CLOCK_DIVIDER_8 == clockSourceDivider) ||
        (UCS_CLOCK_DIVIDER_16 == clockSourceDivider) ||
        (UCS_CLOCK_DIVIDER_32 == clockSourceDivider)
        );

    switch (selectedClockSignal){
        case UCS_ACLK:
            HWREG16(baseAddress + OFS_UCSCTL4) &= ~(SELA_7);
            clockSource = clockSource << 8;
            HWREG16(baseAddress + OFS_UCSCTL4) |= (clockSource);

            HWREG16(baseAddress + OFS_UCSCTL5) &= ~(DIVA_7);
            clockSourceDivider = clockSourceDivider << 8;
            HWREG16(baseAddress + OFS_UCSCTL5) |= clockSourceDivider;
            break;
        case UCS_SMCLK:
            HWREG16(baseAddress + OFS_UCSCTL4) &= ~(SELS_7);
            clockSource = clockSource << 4;
            HWREG16(baseAddress + OFS_UCSCTL4) |= (clockSource);

            HWREG16(baseAddress + OFS_UCSCTL5) &= ~(DIVS_7);
            clockSourceDivider = clockSourceDivider << 4;
            HWREG16(baseAddress + OFS_UCSCTL5) |= clockSourceDivider;
            break;
        case UCS_MCLK:
            HWREG16(baseAddress + OFS_UCSCTL4) &= ~(SELM_7);
            HWREG16(baseAddress + OFS_UCSCTL4) |= (clockSource);

            HWREG16(baseAddress + OFS_UCSCTL5) &= ~(DIVM_7);
            HWREG16(baseAddress + OFS_UCSCTL5) |= clockSourceDivider;
            break;
        case UCS_FLLREF:
            assert(clockSource <= SELA_5);
            HWREG8(baseAddress + OFS_UCSCTL3) &=  ~(SELREF_7);

            clockSource = clockSource << 4;
            HWREG8(baseAddress + OFS_UCSCTL3) |= (clockSource);

            HWREG8(baseAddress + OFS_UCSCTL3) &= ~(FLLREFDIV_7);
            //Note that dividers for FLLREF are slightly different
            //Hence handled differently from other CLK signals
            switch(clockSourceDivider)
            {
              case UCS_CLOCK_DIVIDER_12:  
                HWREG8(baseAddress + OFS_UCSCTL3) |= UCS_CLOCK_DIVIDER_16;
                break;
              case UCS_CLOCK_DIVIDER_16:  
                HWREG8(baseAddress + OFS_UCSCTL3) |= UCS_CLOCK_DIVIDER_12;
                break;
              default:       
                HWREG8(baseAddress + OFS_UCSCTL3) |= clockSourceDivider;
                break;
            }
            
            break;
    }
}

//******************************************************************************
//
//! Initializes the XT1 crystal oscillator in low frequency mode. Loops until
//! all oscillator fault flags are cleared, with no timeout. See the
//! device-specific data sheet for appropriate drive settings.
//!
//! \param baseAddress is the base address of the UCS module.
//! \param xt1drive is the target drive strength for the XT1 crystal oscillator.
//!         Valid values are
//!         \b UCS_XT1_DRIVE0,
//!         \b UCS_XT1_DRIVE1,
//!         \b UCS_XT1_DRIVE2,
//!         \b UCS_XT1_DRIVE3 [Default value].
//!        Modified bits are \b XT1DRIVE of \b UCSCTL6 register.
//! \param xcap is the selected capactor value.
//!         Valid values are:
//!         \b UCS_XCAP_0,
//!         \b UCS_XCAP_1,
//!         \b UCS_XCAP_2
//!         \b UCS_XCAP_3 [Default value]
//!         This parameter selects the capacitors applied to the LF crystal
//!         (XT1) or resonator in the LF mode. The  effective capacitance
//!         (seen by the crystal) is Ceff . (CXIN + 2 pF)/2. It is assumed that
//!         CXIN = CXOUT and that a parasitic capacitance of 2 pF is added by
//!         the package and the printed circuit board. For details about the
//!         typical internal and the effective capacitors, refer to the
//!         device-specific data sheet.
//!
//!        Modified bits are \b XCAP of \b UCSCTL6 register.
//!
//! \return None
//
//******************************************************************************
void
UCS_LFXT1Start ( uint32_t baseAddress,
    uint16_t xt1drive,
    uint8_t xcap
    )
{
    assert((xcap == UCS_XCAP_0) ||
        (xcap == UCS_XCAP_1) ||
        (xcap == UCS_XCAP_2) ||
        (xcap == UCS_XCAP_3) );

    assert((xt1drive == UCS_XT1_DRIVE0 ) ||
        (xt1drive == UCS_XT1_DRIVE1 ) ||
        (xt1drive == UCS_XT1_DRIVE2 ) ||
        (xt1drive == UCS_XT1_DRIVE3 ));

    //If the drive setting is not already set to maximum
    //Set it to max for LFXT startup
    if ((HWREG16(baseAddress + OFS_UCSCTL6) & XT1DRIVE_3) != XT1DRIVE_3){
        //Highest drive setting for XT1startup
        HWREG16(baseAddress + OFS_UCSCTL6_L) |= XT1DRIVE1_L + XT1DRIVE0_L;
    }

    //Enable LF mode and clear xcap and bypass
    HWREG16(baseAddress + OFS_UCSCTL6) &= ~(XTS + XCAP_3 + XT1BYPASS);
    HWREG16(baseAddress + OFS_UCSCTL6) |= xcap;

    while (HWREG8(baseAddress + OFS_UCSCTL7) & XT1LFOFFG)
    {
        //Clear OSC flaut Flags fault flags
        HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1LFOFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    //set requested Drive mode
    HWREG16(baseAddress + OFS_UCSCTL6) = ( HWREG16(baseAddress + OFS_UCSCTL6) &
                                         ~(XT1DRIVE_3)
                                         ) |
                                       (xt1drive);


    //Switch ON XT1 oscillator
    HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT1OFF;
}

//******************************************************************************
//
//! Initializes the XT1 crystal oscillator in high frequency mode. Loops until
//! all oscillator fault flags are cleared, with no timeout. See the
//! device-specific data sheet for appropriate drive settings.
//!
//! \param baseAddress is the base address of the UCS module.
//! \param xt1drive is the target drive strength for the XT1 crystal oscillator.
//!        Valid values are
//!         \b UCS_XT1_DRIVE0 ,
//!         \b UCS_XT1_DRIVE1,
//!         \b UCS_XT1_DRIVE2 ,
//!         \b UCS_XT1_DRIVE3[Default Value]
//!
//! Modified registers are \b UCSCTL6, \b UCSCTL7, \b SFRIFG
//!
//! \return None
//
//******************************************************************************
void
UCS_HFXT1Start (
    uint32_t baseAddress,
    uint16_t xt1drive
    )
{
    //Check if drive value is the expected one
    if ((HWREG16(baseAddress + OFS_UCSCTL6) & XT1DRIVE_3) != xt1drive){
        //Clear XT1drive field
        HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT1DRIVE_3;

