AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/ucs.c
        //Set requested value
        HWREG16(baseAddress + OFS_UCSCTL6) |= xt1drive;
    }

    //Enable HF mode
    HWREG16(baseAddress + OFS_UCSCTL6) |= XTS;

    HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT1BYPASS;

    // Check XT1 fault flags
    while((HWREG8(baseAddress + OFS_UCSCTL7) & (XT1HFOFFG))){                  
        //Clear OSC flaut Flags fault flags
        HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1HFOFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    //Switch ON XT1 oscillator
    HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT1OFF;
}

//******************************************************************************
//
//! Bypasses the XT1 crystal oscillator. Loops until all oscillator fault
//! flags are cleared, with no timeout.
//!
//! \param baseAddress is the base address of the UCS module.
//! \param highOrLowFrequency selects high frequency or low frequency mode for
//!         XT1. Valid values are
//!        \b UCS_XT1_HIGH_FREQUENCY,
//!        \b UCS_XT1_LOW_FREQUENCY [Default Value]
//!
//! Modified registers are \b UCSCTL6, \b UCSCTL7, \b SFRIFG
//! \return None
//
//******************************************************************************
void
UCS_bypassXT1 ( uint32_t baseAddress,
    uint8_t highOrLowFrequency
    )
{
    assert((UCS_XT1_LOW_FREQUENCY == highOrLowFrequency) ||
        (UCS_XT1_HIGH_FREQUENCY == highOrLowFrequency )
        );

    //Enable HF/LF mode
    HWREG16(baseAddress + OFS_UCSCTL6) &= ~XTS;
    HWREG16(baseAddress + OFS_UCSCTL6) |= highOrLowFrequency;

    //Switch OFF XT1 oscillator and enable BYPASS mode
    HWREG16(baseAddress + OFS_UCSCTL6) |= (XT1BYPASS + XT1OFF);

   
    if (UCS_XT1_LOW_FREQUENCY == highOrLowFrequency){
      while (HWREG8(baseAddress + OFS_UCSCTL7) & (XT1LFOFFG)) {
        //Clear OSC flaut Flags fault flags
        HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1LFOFFG);
        
        // Clear the global fault flag. In case the XT1 caused the global fault 
        // flag to get set this will clear the global error condition. If any 
        // error condition persists, global flag will get again.
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
      }
    } else   {
        while (HWREG8(baseAddress + OFS_UCSCTL7) & (XT1HFOFFG)) {
          //Clear OSC flaut Flags fault flags
          HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1HFOFFG);
          
          //Clear the global fault flag. In case the XT1 caused the global fault 
          //flag to get set this will clear the global error condition. If any 
          //error condition persists, global flag will get again.
          HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
        }
      }
 
}

//******************************************************************************
//
//! Initializes the XT1 crystal oscillator in low frequency mode with timeout.
//! Loops until all oscillator fault flags are cleared or until a timeout
//! counter is decremented and equals to zero. See the device-specific
//! datasheet for appropriate drive settings.
//!
//! \param baseAddress is the base address of the UCS module.
//! \param xt1drive is the target drive strength for the XT1 crystal oscillator.
//!        Valid values are
//!         \b UCS_XT1_DRIVE0,
//!         \b UCS_XT1_DRIVE1,
//!         \b UCS_XT1_DRIVE2,
//!         \b UCS_XT1_DRIVE3[Default Value]
//! \param xcap is the selected capactor value. Valid values are:
//!        \b UCS_XCAP_0,
//!        \b UCS_XCAP_1,
//!        \b UCS_XCAP_2,
//!        \b UCS_XCAP_3[Default Value]
//!  This parameter selects the capacitors applied to the LF crystal
//! (XT1) or resonator in the LF mode. The  effective capacitance
//! (seen by the crystal) is Ceff . (CXIN + 2 pF)/2. It is assumed that
//! CXIN = CXOUT and that a parasitic capacitance of 2 pF is added by
//! the package and the printed circuit board. For details about the
//! typical internal and the effective capacitors, refer to the
//! device-specific data sheet.
//!
//! \param timeout is the count value that gets decremented every time the loop
//!         that clears oscillator fault flags gets executed.
//!
//! Modified registers are \b UCSCTL6, \b UCSCTL7, \b SFRIFG
//!
//! \return STATUS_SUCCESS or STATUS_FAIL
//
//******************************************************************************
unsigned short
UCS_LFXT1StartWithTimeout (
    uint32_t baseAddress,
    uint16_t xt1drive,
    uint8_t xcap,
    uint16_t timeout
    )
{
    assert((xcap == UCS_XCAP_0) ||
        (xcap == UCS_XCAP_1) ||
        (xcap == UCS_XCAP_2) ||
        (xcap == UCS_XCAP_3) );

    assert((xt1drive == UCS_XT1_DRIVE0 ) ||
        (xt1drive == UCS_XT1_DRIVE1 ) ||
        (xt1drive == UCS_XT1_DRIVE2 ) ||
        (xt1drive == UCS_XT1_DRIVE3 ));

    //If the drive setting is not already set to maximum
    //Set it to max for LFXT startup
    if ((HWREG16(baseAddress + OFS_UCSCTL6) & XT1DRIVE_3) != XT1DRIVE_3){
        //Highest drive setting for XT1startup
        HWREG16(baseAddress + OFS_UCSCTL6_L) |= XT1DRIVE1_L + XT1DRIVE0_L;
    }

   	//Enable LF mode and clear xcap and bypass
    HWREG16(baseAddress + OFS_UCSCTL6) &= ~(XTS + XCAP_3 + XT1BYPASS);
    HWREG16(baseAddress + OFS_UCSCTL6) |= xcap;

    do
    {
        HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1LFOFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }while ((HWREG8(baseAddress + OFS_UCSCTL7) & XT1LFOFFG) && --timeout);         

    if (timeout){
        //set requested Drive mode
        HWREG16(baseAddress + OFS_UCSCTL6) = ( HWREG16(baseAddress + OFS_UCSCTL6) &
                                             ~(XT1DRIVE_3)
                                             ) |
                                           (xt1drive);
        //Switch ON XT1 oscillator
        HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT1OFF;

        return (STATUS_SUCCESS);
    } else   {
        return (STATUS_FAIL);
    }
}

//******************************************************************************
//
//! Initializes the XT1 crystal oscillator in high freqquency mode with timeout.
//! Loops until all oscillator fault flags are cleared or until a timeout
//! counter is decremented and equals to zero. See the device-specific data
//! sheet for appropriate drive settings.
//!
//! \param baseAddress is the base address of the UCS module.
//! \param xt1drive is the target drive strength for the XT1 crystal oscillator.
//!        Valid values are
//!         \b UCS_XT1_DRIVE0,
//!         \b UCS_XT1_DRIVE1,
//!         \b UCS_XT1_DRIVE2,
//!         \b UCS_XT1_DRIVE3 [Default Value]
//! \param timeout is the count value that gets decremented every time the loop
//!         that clears oscillator fault flags gets executed.
//!
//! Modified registers are \b UCSCTL6, \b UCSCTL7, \b SFRIFG
//!
//! \return STATUS_SUCCESS or STATUS_FAIL
//
//******************************************************************************
unsigned short
UCS_HFXT1StartWithTimeout (  uint32_t baseAddress,
    uint16_t xt1drive,
    uint16_t timeout
    )
{
    assert((xt1drive == UCS_XT1_DRIVE0 ) ||
        (xt1drive == UCS_XT1_DRIVE1 ) ||
        (xt1drive == UCS_XT1_DRIVE2 ) ||
        (xt1drive == UCS_XT1_DRIVE3 ));


    //Check if drive value is the expected one
    if ((HWREG16(baseAddress + OFS_UCSCTL6) & XT1DRIVE_3) != xt1drive){
        //Clear XT1drive field
        HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT1DRIVE_3;

