AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/ucs.c
        //Set requested value
        HWREG16(baseAddress + OFS_UCSCTL6) |= xt1drive;
    }

    //Enable HF mode
    HWREG16(baseAddress + OFS_UCSCTL6) |= XTS;

    HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT1BYPASS;

    // Check XT1 fault flags
    do
    {
        HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1HFOFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }while ((HWREG8(baseAddress + OFS_UCSCTL7) & ( XT1HFOFFG)) 
            && --timeout); 

    if (timeout){
        //Switch ON XT1 oscillator
        HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT1OFF;

        return (STATUS_SUCCESS);
    } else   {
        return (STATUS_FAIL);
    }
}

//******************************************************************************
//
//! Bypasses the XT1 crystal oscillator with time out. Loops until all
//! oscillator fault flags are cleared or until a timeout counter is
//! decremented and equals to zero.
//!
//! \param baseAddress is the base address of the UCS module.
//! \param highOrLowFrequency selects high frequency or low frequency mode for
//!        XT1. Valid values are
//!        \b UCS_XT1_HIGH_FREQUENCY,
//!        \b UCS_XT1_LOW_FREQUENCY [Default Value]
//! \param timeout is the count value that gets decremented every time the loop
//!         that clears oscillator fault flags gets executed.
//!
//! Modified registers are \b UCSCTL6, \b UCSCTL7, \b SFRIFG
//!
//! \return STATUS_SUCCESS or STATUS_FAIL
//
//******************************************************************************
unsigned short
UCS_bypassXT1WithTimeout (
    uint32_t baseAddress,
    uint8_t highOrLowFrequency,
    uint16_t timeout
    )
{
    assert((UCS_XT1_LOW_FREQUENCY == highOrLowFrequency) ||
        (UCS_XT1_HIGH_FREQUENCY == highOrLowFrequency )
        );

    //Enable HF/LF mode
    HWREG16(baseAddress + OFS_UCSCTL6) &= ~XTS;
    HWREG16(baseAddress + OFS_UCSCTL6) |= highOrLowFrequency;

    //Switch OFF XT1 oscillator  and enable bypass
    HWREG16(baseAddress + OFS_UCSCTL6) |= (XT1BYPASS + XT1OFF);

       
    if (UCS_XT1_LOW_FREQUENCY == highOrLowFrequency){
      do {
        //Clear OSC flaut Flags fault flags
        HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1LFOFFG);
        
        // Clear the global fault flag. In case the XT1 caused the global fault 
        // flag to get set this will clear the global error condition. If any 
        // error condition persists, global flag will get again.
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
      }while ((HWREG8(baseAddress + OFS_UCSCTL7) & (XT1LFOFFG)) && --timeout);
      
    } else   {
        do {
          //Clear OSC flaut Flags fault flags
          HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1HFOFFG);
          
          //Clear the global fault flag. In case the XT1 caused the global fault 
          //flag to get set this will clear the global error condition. If any 
          //error condition persists, global flag will get again.
          HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
        }while ((HWREG8(baseAddress + OFS_UCSCTL7) & (XT1HFOFFG))&& --timeout);
    }


    if (timeout){
        return (STATUS_SUCCESS);
    } else {
        return (STATUS_FAIL);
    }
}

//******************************************************************************
//
//! Stops the XT1 oscillator using the XT1OFF bit.
//!
//! \param baseAddress is the base address of the UCS module.
//!
//! \return None
//
//******************************************************************************
void
UCS_XT1Off (uint32_t baseAddress)
{
    //Switch off XT1 oscillator
    HWREG16(baseAddress + OFS_UCSCTL6) |= XT1OFF;
}

//******************************************************************************
//
//! Initializes the XT2 crystal oscillator, which supports crystal frequencies
//! between 4 MHz and 32 MHz, depending on the selected drive strength. Loops
//! until all oscillator fault flags are cleared, with no timeout. See the
//! device-specific data sheet for appropriate drive settings.
//!
//! \param baseAddress is the base address of the UCS module.
//! \param xt2drive is the target drive strength for the XT2 crystal oscillator.
//!      Valid values are
//!     \b UCS_XT2DRIVE_4MHZ_8MHZ,
//!     \b UCS_XT2DRIVE_8MHZ_16MHZ,
//!     \b UCS_XT2DRIVE_16MHZ_24MHZ,
//!     \b UCS_XT2DRIVE_24MHZ_32MHZ [Default Value]
//!
//! Modified registers are \b UCSCTL6, \b UCSCTL7, \b SFRIFG
//!
//! \return None
//
//******************************************************************************
void
UCS_XT2Start (  uint32_t baseAddress,
    uint16_t xt2drive
    )
{
#if !defined (__CC430F5133__) || (__CC430F5135__) || (__CC430F5137__) || \
            (__CC430F6125__) || (__CC430F6126__) || (__CC430F6127__) || \
            (__CC430F6135__) || (__CC430F6137__) || (__CC430F5123__) || \
            (__CC430F5125__) || (__CC430F5143__) || (__CC430F5145__) || \
            (__CC430F5147__) || (__CC430F6143__) || (__CC430F6145__) || \
            (__CC430F6147__)

    //Check if drive value is the expected one
    if ((HWREG16(baseAddress + OFS_UCSCTL6) & XT2DRIVE_3) != xt2drive){
        //Clear XT2drive field
        HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT2DRIVE_3;

        //Set requested value
        HWREG16(baseAddress + OFS_UCSCTL6) |= xt2drive;
    }
#endif     

    //Enable XT2 and Switch on XT2 oscillator
    HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT2BYPASS;
    HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT2OFF;

    while (HWREG8(baseAddress + OFS_UCSCTL7) & XT2OFFG){             
     //Clear OSC flaut Flags
     HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT2OFFG);
     
#if defined (__CC430F5133__) || (__CC430F5135__) || (__CC430F5137__) || \
            (__CC430F6125__) || (__CC430F6126__) || (__CC430F6127__) || \
            (__CC430F6135__) || (__CC430F6137__) || (__CC430F5123__) || \
            (__CC430F5125__) || (__CC430F5143__) || (__CC430F5145__) || \
            (__CC430F5147__) || (__CC430F6143__) || (__CC430F6145__) || \
            (__CC430F6147__)
        // CC430 uses a different fault mechanism. It requires 3 VLO clock 
        // cycles delay.If 20MHz CPU, 5000 clock cycles are required in worst 
        // case.
        __delay_cycles(5000);
#endif

     //Clear OFIFG fault flag
     HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }
}

