AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/ucs.c
//******************************************************************************
//
//! Stops the XT2 oscillator using the XT2OFF bit.
//!
//! \param baseAddress is the base address of the UCS module.
//!
//! Modified registers are \b UCSCTL6
//!
//! \return None
//
//******************************************************************************
void
UCS_XT2Off (uint32_t baseAddress)
{
    //Switch off XT2 oscillator
    HWREG16(baseAddress + OFS_UCSCTL6) |= XT2OFF;
}

//******************************************************************************
//
//! Initializes the DCO to operate a frequency that is a multiple of the
//! reference frequency into the FLL. Loops until all oscillator fault flags are
//! cleared, with a timeout. If the frequency is greater than 16 MHz,
//! the function sets the MCLK and SMCLK source to the undivided DCO frequency.
//! Otherwise, the function sets the MCLK and SMCLK source to the
//! DCOCLKDIV frequency.
//! This function executes a software delay that is proportional in length to
//! the ratio of the target FLL frequency and the FLL reference.
//!
//! \param baseAddress is the base address of the UCS module.
//! \param fsystem is the target frequency for MCLK in kHz
//! \param ratio is the ratio x/y, where x = fsystem and
//!         y = FLL reference frequency.
//!
//! Modified registers are \b UCSCTL0, \b UCSCTL1, \b UCSCTL2, \b UCSCTL4,
//! \b UCSCTL7, \b SFRIFG1
//!
//! \return None
//
//******************************************************************************
void
UCS_initFLLSettle ( uint32_t baseAddress,
    uint16_t fsystem,
    uint16_t ratio
    )
{
    volatile uint16_t x = ratio * 32;

    UCS_initFLL(baseAddress, fsystem, ratio);

    while (x--)
    {
        __delay_cycles(30);
    }
}

//******************************************************************************
//
//! Initializes the DCO to operate a frequency that is a multiple of the
//! reference frequency into the FLL. Loops until all oscillator fault flags are
//! cleared, with no timeout. If the frequency is greater than 16 MHz,
//! the function sets the MCLK and SMCLK source to the undivided DCO frequency.
//! Otherwise, the function sets the MCLK and SMCLK source to the
//! DCOCLKDIV frequency.
//!
//! \param baseAddress is the base address of the UCS module.
//! \param fsystem is the target frequency for MCLK in kHz
//! \param ratio is the ratio x/y, where x = fsystem and
//!         y = FLL reference frequency.
//!
//! Modified registers are \b UCSCTL0, \b UCSCTL1, \b UCSCTL2, \b UCSCTL4,
//! \b UCSCTL7, \b SFRIFG1
//!
//! \return None
//
//******************************************************************************
void
UCS_initFLL ( uint32_t baseAddress,
    uint16_t fsystem,
    uint16_t ratio
    )
{
    uint16_t d, dco_div_bits;
    uint16_t mode = 0;

    //Save actual state of FLL loop control, then disable it. This is needed to
    //prevent the FLL from acting as we are making fundamental modifications to
    //the clock setup.
    uint16_t srRegisterState = __get_SR_register() & SCG0;

    d = ratio;
    //Have at least a divider of 2
    dco_div_bits = FLLD__2;

    if (fsystem > 16000){
        d >>= 1 ;
        mode = 1;
    } else   {
        //fsystem = fsystem * 2
        fsystem <<= 1;
    }

    while (d > 512)
    {
        //Set next higher div level
        dco_div_bits = dco_div_bits + FLLD0;
        d >>= 1;
    }

    // Disable FLL
    __bis_SR_register(SCG0);                                    

    //Set DCO to lowest Tap
    HWREG8(baseAddress + OFS_UCSCTL0_H) = 0x0000;

    //Reset FN bits
    HWREG16(baseAddress + OFS_UCSCTL2) &= ~(0x03FF);
    HWREG16(baseAddress + OFS_UCSCTL2) = dco_div_bits | (d - 1);

    if (fsystem <= 630){           //fsystem < 0.63MHz
        HWREG8(baseAddress + OFS_UCSCTL1) = DCORSEL_0;
    } else if (fsystem <  1250){      //0.63MHz < fsystem < 1.25MHz
        HWREG8(baseAddress + OFS_UCSCTL1) = DCORSEL_1;
    } else if (fsystem <  2500){      //1.25MHz < fsystem <  2.5MHz
        HWREG8(baseAddress + OFS_UCSCTL1) = DCORSEL_2;
    } else if (fsystem <  5000){      //2.5MHz  < fsystem <    5MHz
        HWREG8(baseAddress + OFS_UCSCTL1) = DCORSEL_3;
    } else if (fsystem <  10000){     //5MHz    < fsystem <   10MHz
        HWREG8(baseAddress + OFS_UCSCTL1) = DCORSEL_4;
    } else if (fsystem <  20000){     //10MHz   < fsystem <   20MHz
        HWREG8(baseAddress + OFS_UCSCTL1) = DCORSEL_5;
    } else if (fsystem <  40000){     //20MHz   < fsystem <   40MHz
        HWREG8(baseAddress + OFS_UCSCTL1) = DCORSEL_6;
    } else {
        HWREG8(baseAddress + OFS_UCSCTL1) = DCORSEL_7;
    }

    // Re-enable FLL
     __bic_SR_register(SCG0);                                    
    
    while (HWREG8(baseAddress + OFS_UCSCTL7_L) & DCOFFG)  
    {
        //Clear OSC flaut Flags
        HWREG8(baseAddress + OFS_UCSCTL7_L) &= ~(DCOFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    // Restore previous SCG0
    __bis_SR_register(srRegisterState);                         
    
    if (mode == 1){
        //fsystem > 16000
        //Select DCOCLK
        HWREG16(baseAddress + OFS_UCSCTL4) &=  ~(SELM_7 + SELS_7);
        HWREG16(baseAddress + OFS_UCSCTL4) |= SELM__DCOCLK + SELS__DCOCLK;
    } else   {
        //Select DCODIVCLK
        HWREG16(baseAddress + OFS_UCSCTL4) &=  ~(SELM_7 + SELS_7);
        HWREG16(baseAddress + OFS_UCSCTL4) |= SELM__DCOCLKDIV + SELS__DCOCLKDIV;
    }

}

//******************************************************************************
//
//! Enables conditional module requests
//!
//! \param baseAddress is the base address of the UCS module.
//! \param selectClock selects specific request enables. Valid values are
//!        \b UCS_ACLK,
//!        \b UCS_SMCLK,
//!        \b UCS_MCLK,
//!        \b UCS_MODOSC
//!
//! Modified registers are \b UCSCTL8
//!
//! \return None
//
//******************************************************************************
void
UCS_enableClockRequest (
    uint32_t baseAddress,
    uint8_t selectClock
    )
{
    HWREG8(baseAddress + OFS_UCSCTL8) |= selectClock;
}

