AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/ucs.c
//******************************************************************************
//
//! Disables conditional module requests
//!
//! \param baseAddress is the base address of the UCS module.
//! \param selectClock selects specific request enables. Valid values are
//!        \b UCS_ACLK,
//!        \b UCS_SMCLK,
//!        \b UCS_MCLK,
//!        \b UCS_MODOSC
//!
//! Modified registers are \b UCSCTL8
//!
//! \return None
//
//******************************************************************************
void
UCS_disableClockRequest (
    uint32_t baseAddress,
    uint8_t selectClock
    )
{
    HWREG8(baseAddress + OFS_UCSCTL8) &= ~selectClock;
}

//******************************************************************************
//
//! Gets the current UCS fault flag status.
//!
//! \param baseAddress is the base address of the UCS module.
//! \param mask is the masked interrupt flag status to be returned.
//!      Mask parameter can be either any of the following selection.
//!         - \b UCS_XT2OFFG - XT2 oscillator fault flag
//!         - \b UCS_XT1HFOFFG - XT1 oscillator fault flag (HF mode)
//!         - \b UCS_XT1LFOFFG - XT1 oscillator fault flag (LF mode)
//!         - \b UCS_DCOFFG - DCO fault flag
//!
//! Modified registers are \b UCSCTL7
//!
//! \return The current flag status for the corresponding masked bit
//
//******************************************************************************
uint8_t
UCS_faultFlagStatus (
    uint32_t baseAddress,
    uint8_t mask
    )
{
    assert(mask <= UCS_XT2OFFG );
    return (HWREG8(baseAddress + OFS_UCSCTL7) & mask);
}

//******************************************************************************
//
//! Clears the current UCS fault flag status for the masked bit.
//!
//! \param baseAddress is the base address of the UCS module.
//! \param mask is the masked interrupt flag status to be returned.
//!         mask parameter can be any one of the following
//!             - \b UCS_XT2OFFG - XT2 oscillator fault flag
//!             - \b UCS_XT1HFOFFG - XT1 oscillator fault flag (HF mode)
//!             - \b UCS_XT1LFOFFG - XT1 oscillator fault flag (LF mode)
//!             - \b UCS_DCOFFG - DCO fault flag
//!
//! Modified registers are \b UCSCTL7
//!
//! \return None
//
//******************************************************************************
void
UCS_clearFaultFlag (
    uint32_t baseAddress,
    uint8_t mask
    )
{
    assert(mask <= UCS_XT2OFFG );
    HWREG8(baseAddress + OFS_UCSCTL7) &= ~mask;
}

//******************************************************************************
//
//! Turns off SMCLK using the SMCLKOFF bit
//!
//! \param baseAddress is the base address of the UCS module.
//!
//! Modified registers are UCSCTL6
//!
//! \return None
//
//******************************************************************************
void
UCS_SMCLKOff (uint32_t baseAddress)
{
    HWREG16(baseAddress + OFS_UCSCTL6) |= SMCLKOFF;
}

//******************************************************************************
//
//! Turns ON SMCLK using the SMCLKOFF bit
//!
//! \param baseAddress is the base address of the UCS module.
//!
//! Modified registers are \b UCSCTL6
//!
//! \return None
//
//******************************************************************************
void
UCS_SMCLKOn (uint32_t baseAddress)
{
    HWREG16(baseAddress + OFS_UCSCTL6) &= ~SMCLKOFF;
}

//******************************************************************************
//
//Compute the clock frequency when clock is sourced from DCO
//
//\param baseAddress is the base address of the UCS module.
//\param FLLRefCLKSource is clock source for FLL reference. Valid values are
//\b SELM__DCOCLK
//\b SELM__DCOCLKDIV
//
//\return Calculated clock frequency in Hz
//
//******************************************************************************
static uint32_t
privateUCSSourceClockFromDCO ( uint32_t baseAddress,
    uint16_t FLLRefCLKSource
    )
{
    assert((SELM__DCOCLKDIV == FLLRefCLKSource) ||
        (SELM__DCOCLK == FLLRefCLKSource)
        );
    uint16_t D_value = 1;
    uint16_t N_value;
    uint16_t n_value;
    uint32_t Fref_value;
    uint8_t i;

    N_value = (HWREG16(baseAddress + OFS_UCSCTL2)) & 0x03FF;
    uint16_t tempDivider = HWREG8(baseAddress + OFS_UCSCTL3) & FLLREFDIV_7;

    n_value = 1;

    for ( i = 0; i < tempDivider; i++){
        n_value *= 2;
    }

    switch ( (HWREG8(baseAddress + OFS_UCSCTL3)) & SELREF_7){
        case SELREF__XT1CLK:
            Fref_value = UCS_XT1ClockFrequency;

            if(XTS != (HWREG16(baseAddress + OFS_UCSCTL6) & XTS)) {
              if (HWREG8(baseAddress + OFS_UCSCTL7) & XT1LFOFFG){
                HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1LFOFFG);
                //Clear OFIFG fault flag
                HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

                if (HWREG8(baseAddress + OFS_UCSCTL7) & XT1LFOFFG){
                    Fref_value = UCS_REFOCLK_FREQUENCY;
                }
              }
            }
            else {
              if (HWREG8(baseAddress + OFS_UCSCTL7) & XT1HFOFFG){
                HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1HFOFFG);
                //Clear OFIFG fault flag
                HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

                if (HWREG8(baseAddress + OFS_UCSCTL7) & XT1HFOFFG){
                    Fref_value = UCS_REFOCLK_FREQUENCY;
                }
              }
            }

            break;
        case SELREF__REFOCLK:
            Fref_value = UCS_REFOCLK_FREQUENCY;
            break;
        case SELREF__XT2CLK:
            Fref_value = UCS_XT2ClockFrequency;

            if (HWREG8(baseAddress + OFS_UCSCTL7) & XT2OFFG){
                HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT2OFFG);

                //Clear OFIFG fault flag
                HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

                if (HWREG8(baseAddress + OFS_UCSCTL7) & XT2OFFG){
                    Fref_value = UCS_REFOCLK_FREQUENCY;
                }
            }

            break;
        default: assert(0);
    }

