AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/ucs.c
    uint32_t CLKFrequency = Fref_value * ( N_value + 1) / n_value;

    if (SELM__DCOCLK == FLLRefCLKSource){
        uint8_t i;
        tempDivider = (HWREG16(baseAddress + OFS_UCSCTL2)) & FLLD_7;
        tempDivider = tempDivider >> 12;

        for (i = 0; i < tempDivider; i++){
            D_value =  D_value * 2;
        }

        CLKFrequency *= D_value;
    }
    return ( CLKFrequency) ;
}

//******************************************************************************
//
//Compute the clock frequency given the clock source and divider
//
//\param baseAddress is the base address of the UCS module.
//\param CLKSource is the clock source. Valid values are
//\b SELM__XT1CLK,
//\b SELM__VLOCLK,
//\b SELM__REFOCLK,
//\b SELM__XT2CLK,
//\b SELM__DCOCLK,
//\b SELM__DCOCLKDIV
//\param CLKSourceDivider is the Clock source divider
//
//\return Calculated clock frequency in Hz
//
//******************************************************************************
static uint32_t
privateUCSComputeCLKFrequency ( uint32_t baseAddress,
    uint16_t CLKSource,
    uint16_t CLKSourceDivider
    )
{
    uint32_t CLKFrequency;
    uint8_t CLKSourceFrequencyDivider = 1;
    uint8_t i = 0;

    for ( i = 0; i < CLKSourceDivider; i++){
        CLKSourceFrequencyDivider *= 2;
    }

    switch (CLKSource){
        case SELM__XT1CLK:
            CLKFrequency = (UCS_XT1ClockFrequency /
                            CLKSourceFrequencyDivider);

            if(XTS != (HWREG16(baseAddress + OFS_UCSCTL6) & XTS))  {
              if (HWREG8(baseAddress + OFS_UCSCTL7) & XT1LFOFFG){
                HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1LFOFFG);
                //Clear OFIFG fault flag
                HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

                if (HWREG8(baseAddress + OFS_UCSCTL7) & XT1LFOFFG){
                    CLKFrequency = UCS_REFOCLK_FREQUENCY;
                }
              }
            }
            else {
              if (HWREG8(baseAddress + OFS_UCSCTL7) & XT1HFOFFG){
                HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1HFOFFG);
                //Clear OFIFG fault flag
                HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

                if (HWREG8(baseAddress + OFS_UCSCTL7) & XT1HFOFFG){
                    CLKFrequency = UCS_REFOCLK_FREQUENCY;
                }
              }
            }
            break;

        case SELM__VLOCLK:
            CLKFrequency =
                (UCS_VLOCLK_FREQUENCY / CLKSourceFrequencyDivider);
            break;
        case SELM__REFOCLK:
            CLKFrequency =
                (UCS_REFOCLK_FREQUENCY / CLKSourceFrequencyDivider);
            break;
        case SELM__XT2CLK:
            CLKFrequency =
                (UCS_XT2ClockFrequency / CLKSourceFrequencyDivider);

            if (HWREG8(baseAddress + OFS_UCSCTL7) & XT2OFFG){

              HWREG8(baseAddress + OFS_UCSCTL7) &=  ~XT2OFFG;
              //Clear OFIFG fault flag
              HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
            }

            if (HWREG8(baseAddress + OFS_UCSCTL7) & XT2OFFG){
                CLKFrequency =
                    privateUCSSourceClockFromDCO(baseAddress, SELM__DCOCLKDIV);
            }
            break;
        case SELM__DCOCLK:
        case SELM__DCOCLKDIV:
            CLKFrequency = privateUCSSourceClockFromDCO(baseAddress,
            CLKSource
            );
            break;
    }

    return ( CLKFrequency) ;
}

//******************************************************************************
//
//! Get the current ACLK frequency.  The user of this API must ensure that
//! UCS_externalClockSourceInit API was invoked before in case XT1 or XT2
//! is being used.
//!
//! \param baseAddress is the base address of the UCS module.
//!
//! \return Current ACLK frequency in Hz
//
//******************************************************************************
uint32_t
UCS_getACLK (uint32_t baseAddress)
{
    //Find ACLK source
    uint16_t ACLKSource = (HWREG16(baseAddress + OFS_UCSCTL4) & SELA_7);

    ACLKSource = ACLKSource >> 8;

    uint16_t ACLKSourceDivider =  HWREG16(baseAddress + OFS_UCSCTL5) & DIVA_7;
    ACLKSourceDivider = ACLKSourceDivider >> 8;

    return (privateUCSComputeCLKFrequency(baseAddress,
                ACLKSource,
                ACLKSourceDivider
                ));
}

//******************************************************************************
//
//! Get the current SMCLK frequency.  The user of this API must ensure that
//! UCS_externalClockSourceInit API was invoked before in case XT1 or XT2
//! is being used.
//!
//! \param baseAddress is the base address of the UCS module.
//!
//! \return Current SMCLK frequency in Hz
//
//******************************************************************************
uint32_t
UCS_getSMCLK (uint32_t baseAddress)
{
    uint16_t SMCLKSource = HWREG8(baseAddress + OFS_UCSCTL4_L) & SELS_7;

    SMCLKSource = SMCLKSource >> 4;

    uint16_t SMCLKSourceDivider =
        HWREG16(baseAddress + OFS_UCSCTL5) & DIVS_7;
    SMCLKSourceDivider = SMCLKSourceDivider >> 4;

    return (privateUCSComputeCLKFrequency(baseAddress,
                SMCLKSource,
                SMCLKSourceDivider )
            );
}

//******************************************************************************
//
//! Get the current MCLK frequency. The user of this API must ensure that
//! UCS_externalClockSourceInit API was invoked before in case XT1 or XT2
//! is being used.
//!
//! \param baseAddress is the base address of the UCS module.
//!
//! \return Current MCLK frequency in Hz
//
//******************************************************************************
uint32_t
UCS_getMCLK (uint32_t baseAddress)
{
    //Find AMCLK source
    uint16_t MCLKSource = (HWREG16(baseAddress + OFS_UCSCTL4) & SELM_7);

    uint16_t MCLKSourceDivider =  HWREG16(baseAddress + OFS_UCSCTL5) & DIVM_7;

    return (privateUCSComputeCLKFrequency(baseAddress,
                MCLKSource,
                MCLKSourceDivider )
            );
}

