AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/ucs.c
//******************************************************************************
//
//! Clears all the Oscillator Flags
//!
//! \param baseAddress is the base address of the UCS module.
//! \param timeout is the count value that gets decremented every time the loop
//!         that clears oscillator fault flags gets executed.
//!
//! \return the mask of the oscillator flag status.
//
//******************************************************************************
uint16_t UCS_clearAllOscFlagsWithTimeout(uint32_t baseAddress, 
                                             uint16_t timeout
                                             )
{
    do {
      // Clear all osc fault flags
      HWREG8(baseAddress + OFS_UCSCTL7) &= ~(DCOFFG + 
                                             XT1LFOFFG + 
                                             XT1HFOFFG + 
                                             XT2OFFG
                                             ); 



#if defined (__CC430F5133__) || (__CC430F5135__) || (__CC430F5137__) || \
            (__CC430F6125__) || (__CC430F6126__) || (__CC430F6127__) || \
            (__CC430F6135__) || (__CC430F6137__) || (__CC430F5123__) || \
            (__CC430F5125__) || (__CC430F5143__) || (__CC430F5145__) || \
            (__CC430F5147__) || (__CC430F6143__) || (__CC430F6145__) || \
            (__CC430F6147__)
        // CC430 uses a different fault mechanism. It requires 3 VLO clock 
        // cycles delay.If 20MHz CPU, 5000 clock cycles are required in worst 
        // case.
        __delay_cycles(5000);
#endif

      // Clear the global osc fault flag.
      HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
      
      // Check XT1 fault flags
    } while ((HWREG8(SFR_BASE + OFS_SFRIFG1) & OFIFG) && --timeout);                   

    return (HWREG8(baseAddress + OFS_UCSCTL7) & (DCOFFG + 
                                                 XT1LFOFFG + 
                                                 XT1HFOFFG + 
                                                 XT2OFFG)
                                                );
}
//******************************************************************************
//
//Close the Doxygen group.
//! @}
//
//******************************************************************************
